In [1]:
import pandas as pd

In [5]:
m_cols = ['movie_id', 'title', 'release_date', 
            'video_release_date', 'imdb_url']

movies_df = pd.read_csv('/Users/flatironschool/Work/data-science/lecture-notes/regression-modeling/pandas-practice/moviedata.csv', sep='|', names=m_cols, usecols=range(5), encoding='utf-8')

In [6]:
movies_df.head()

,movie_id,title,release_date,video_release_date,imdb_url
0,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...
1,2,GoldenEye (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...
2,3,Four Rooms (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Four%20Rooms%...
3,4,Get Shorty (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Get%20Shorty%...
4,5,Copycat (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Copycat%20(1995)

In [8]:
movies_df[['title', 'release_date']][0:5]

               title release_date
0   Toy Story (1995)  01-Jan-1995
1   GoldenEye (1995)  01-Jan-1995
2  Four Rooms (1995)  01-Jan-1995
3  Get Shorty (1995)  01-Jan-1995
4     Copycat (1995)  01-Jan-1995

In [19]:
movies_df.loc[[0, 1], ['title', 'release_date']]

              title release_date
0  Toy Story (1995)  01-Jan-1995
1  GoldenEye (1995)  01-Jan-1995

In [20]:
movies_df.describe()

          movie_id  video_release_date
count  1682.000000                 0.0
mean    841.500000                 NaN
std     485.695893                 NaN
min       1.000000                 NaN
25%     421.250000                 NaN
50%     841.500000                 NaN
75%    1261.750000                 NaN
max    1682.000000                 NaN

In [22]:
movies_df.columns

Index(['movie_id', 'title', 'release_date', 'video_release_date', 'imdb_url'], dtype='object')

In [34]:
movies_df.shape

(1682, 5)

In [36]:
movies_df.tail()

,movie_id,title,release_date,video_release_date,imdb_url
1677,1678,Mat' i syn (1997),06-Feb-1998,NaN,http://us.imdb.com/M/title-exact?Mat%27+i+syn+...
1678,1679,B. Monkey (1998),06-Feb-1998,NaN,http://us.imdb.com/M/title-exact?B%2E+Monkey+(...
1679,1680,Sliding Doors (1998),01-Jan-1998,NaN,http://us.imdb.com/Title?Sliding+Doors+(1998)
1680,1681,You So Crazy (1994),01-Jan-1994,NaN,http://us.imdb.com/M/title-exact?You%20So%20Cr...
1681,1682,Scream of Stone (Schrei aus Stein) (1991),08-Mar-1996,NaN,http://us.imdb.com/M/title-exact?Schrei%20aus%...

In [44]:
movies_df['title'].isna().sum()

0

### Series

In [49]:
series = pd.Series(data=['yellow', 'green'], index=['blue', 'orange'])